// ৫. অনেকগুলা সংখ্যার একটা array হবে। তারপর তোমার কাজ হবে array এর উপরে map ইউজ করে। প্রত্যেকটা উপাদানকে ৫ দিয়ে গুন্ করে গুনফল আরেকটা array হিসেবে রাখবে। পুরা কাজটা এক লাইনে হবে। 
const numbers = [2, 4, 6, 8, 10];
const fiveMultiple = numbers.map(five => five * 5);
// console.log(fiveMultiple);
// ৬. [ চ্যালেঞ্জিং। গুগলে সার্চ দিয়ে বের করো ] অনেকগুলা সংখ্যার একটা array থেকে শুধু বিজোড় সংখ্যা বের করে নিয়ে আসার জন্য filter ইউজ করো 
const oddEven = [1, 2, 3, 4, 5, 6, 7, 8, 9, 11];
const oddNumbers = oddEven.filter(odd => odd % 2 !== 0);
// console.log(oddNumbers);
// ৭. একটা array এর মধ্যে অনেকগুলা অবজেক্ট আছে। সেখানে যেই অবজেক্ট এর price আছে ৫০০০ টেক্কা সেই অবজেক্টকে find দিয়ে বের করো। 
const phone = [
  {
    name: "Ralme C12",
    ram: "4GB",
    storage: "32GB",
    camera: "8MP",
    price: 5000,
  },
  {
    name: "Ralme C12",
    ram: "4GB",
    storage: "32GB",
    camera: "8MP",
    price: 6000,
  },
  {
    name: "Ralme C12",
    ram: "4GB",
    storage: "32GB",
    camera: "8MP",
    price: 7000,
  },
];
const price = phone.find(p => p.price );
// console.log(price);
// ৭.৫ [এক্সট্রা] জাভাস্ক্রিপ্ট এ array এর map, forEach, filter, find কোনটা দিয়ে কি হয়। সেটার একটা সামারি লিখে ফেলো। 
/**
 * 1.Map()--
 *  -যখনই আমরা কোন Array তে map()এপ্লাই করি তখন এই মেথড তার আর্গুমেন্ট হিসেবে একটা user define functionনেয়,  সেই functionঐ Array র প্রতিটা element এ এপ্লাই হয় এবং তার উপর ভিত্তি করে ফাইনালি নতুন একটা Array রিটার্ন করে।
 * 2.filter()
 *     -ফিল্টার মেথড টা খুবই মজার, filter() ওয়ার্ড টা শুনলেই অনেকটা বুঝা যায় এর কাজটা কি, filter() মানে হচ্ছে  
 *      ছাঁকনি, এখন কথা হচ্ছে এই ছাঁকনি দিয়ে অ্যারেতে কি কাজ, আচ্ছা দেখা যাক কি করা যায় এই ছাঁকনি দিয়ে।
        একটা অ্যারে হতে বিভিন্নভাবে নির্দিষ্ট কিছু ইলিমেন্ট গুলাকে বের করে করে নতুন অ্যারেতে রাখাই এই filter() এর কাজ।
*3.Reduce():
map(), filter() এর মতো reduce() ও একটা কলব্যাক ফাংশন তার আর্গুমেন্ট হিসেবে নেয়, এবং ফাংশনকে প্রতিটা ইলিমেন্ট এর উপর এপ্লাই করে ফাইনাল্লি সিঙ্গেল ভ্যালু রিটার্ন করে।
4.
 */